nc: 80 
scales: 
  n: [0.50, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, DEPMD, [128, ]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]#2
  - [-1, 1, DEPMD, [256, ]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]#4
  - [-1, 1, DEPMD, [512, ]] # 5-P4/16
  - [-1, 2, RMELAN, [512, ]]# 6
  - [-1, 1, DEPMD, [1024, ]] # 7-P5/32
  - [-1, 2, RMELAN, [1024, ]]# 8
  - [-1, 1, SPPF, [1024]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, SWF, [1]] # cat backbone P4 12
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, SWF, [1]] # cat backbone P3 15
  - [-1, 2, C3k2, [256,False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, SWF, [1]] # cat head P4 18
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]# 29
  - [[-1, 10], 1, SWF, [1]] # cat head P5 21
  - [-1, 2, RMELAN, [1024, ]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5) 23
